cmsis-svd/cmsis-svd/data/Atmel/ATSAME70Q19B.svd
               <register>
                  <name>CMPM</name>
                  <description>PWM Comparison 0 Mode Register</description>
                  <addressOffset>0x08</addressOffset>
                  <size>32</size>
                  <fields>
                     <field>
                        <name>CEN</name>
                        <description>Comparison x Enable</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CTR</name>
                        <description>Comparison x Trigger</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>CPR</name>
                        <description>Comparison x Period</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>CPRCNT</name>
                        <description>Comparison x Period Counter</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>CUPR</name>
                        <description>Comparison x Update Period</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>CUPRCNT</name>
                        <description>Comparison x Update Period Counter</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CMPMUPD</name>
                  <description>PWM Comparison 0 Mode Update Register</description>
                  <addressOffset>0x0C</addressOffset>
                  <size>32</size>
                  <access>write-only</access>
                  <fields>
                     <field>
                        <name>CENUPD</name>
                        <description>Comparison x Enable Update</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>CTRUPD</name>
                        <description>Comparison x Trigger Update</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>CPRUPD</name>
                        <description>Comparison x Period Update</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>CUPRUPD</name>
                        <description>Comparison x Update Period Update</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
            <cluster>
               <dim>4</dim>
               <dimIncrement>32</dimIncrement>
               <name>PWM_CH_NUM[%s]</name>
               <description>PWM Channel Mode Register</description>
               <addressOffset>0x200</addressOffset>
               <register>
                  <name>CMR</name>
                  <description>PWM Channel Mode Register</description>
                  <addressOffset>0x00</addressOffset>
                  <size>32</size>
                  <fields>
                     <field>
                        <name>CPRE</name>
                        <description>Channel Pre-scaler</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>4</bitWidth>
                        <enumeratedValues>
                           <name>CPRESelect</name>
                           <enumeratedValue>
                              <name>MCK</name>
                              <description>Peripheral clock</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>MCK_DIV_2</name>
                              <description>Peripheral clock/2</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>MCK_DIV_4</name>
                              <description>Peripheral clock/4</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>MCK_DIV_8</name>
                              <description>Peripheral clock/8</description>
                              <value>0x3</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>MCK_DIV_16</name>
                              <description>Peripheral clock/16</description>
                              <value>0x4</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>MCK_DIV_32</name>
                              <description>Peripheral clock/32</description>
                              <value>0x5</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>MCK_DIV_64</name>
                              <description>Peripheral clock/64</description>
                              <value>0x6</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>MCK_DIV_128</name>
                              <description>Peripheral clock/128</description>
                              <value>0x7</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>MCK_DIV_256</name>
                              <description>Peripheral clock/256</description>
                              <value>0x8</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>MCK_DIV_512</name>
                              <description>Peripheral clock/512</description>
                              <value>0x9</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>MCK_DIV_1024</name>
                              <description>Peripheral clock/1024</description>
                              <value>0xA</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>CLKA</name>
                              <description>Clock A</description>
                              <value>0xB</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>CLKB</name>
                              <description>Clock B</description>
                              <value>0xC</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>CALG</name>
                        <description>Channel Alignment</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>CALGSelect</name>
                           <enumeratedValue>
                              <name>LEFT_ALIGNED</name>
                              <description>Left aligned</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>CENTER_ALIGNED</name>
                              <description>Center aligned</description>
                              <value>0x1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>CPOL</name>
                        <description>Channel Polarity</description>
                        <bitOffset>9</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>CPOLSelect</name>
                           <enumeratedValue>
                              <name>LOW_POLARITY</name>
                              <description>Waveform starts at low level</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>HIGH_POLARITY</name>
                              <description>Waveform starts at high level</description>
                              <value>0x1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>CES</name>
                        <description>Counter Event Selection</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>CESSelect</name>
                           <enumeratedValue>
                              <name>SINGLE_EVENT</name>
                              <description>At the end of PWM period</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>DOUBLE_EVENT</name>
                              <description>At half of PWM period AND at the end of PWM period</description>
                              <value>0x1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>UPDS</name>
                        <description>Update Selection</description>
                        <bitOffset>11</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>UPDSSelect</name>
                           <enumeratedValue>
                              <name>UPDATE_AT_PERIOD</name>
                              <description>At the next end of PWM period</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>UPDATE_AT_HALF_PERIOD</name>
                              <description>At the next end of Half PWM period</description>
                              <value>0x1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>DPOLI</name>
                        <description>Disabled Polarity Inverted</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>TCTS</name>
                        <description>Timer Counter Trigger Selection</description>
                        <bitOffset>13</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DTE</name>
                        <description>Dead-Time Generator Enable</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DTHI</name>
                        <description>Dead-Time PWMHx Output Inverted</description>
                        <bitOffset>17</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>DTLI</name>
                        <description>Dead-Time PWMLx Output Inverted</description>
                        <bitOffset>18</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PPM</name>
                        <description>Push-Pull Mode</description>
                        <bitOffset>19</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CDTY</name>
                  <description>PWM Channel Duty Cycle Register</description>
                  <addressOffset>0x04</addressOffset>
                  <size>32</size>
                  <fields>
                     <field>
                        <name>CDTY</name>
                        <description>Channel Duty-Cycle</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>24</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CDTYUPD</name>
                  <description>PWM Channel Duty Cycle Update Register</description>
                  <addressOffset>0x08</addressOffset>
                  <size>32</size>
                  <access>write-only</access>
                  <fields>
                     <field>
                        <name>CDTYUPD</name>
                        <description>Channel Duty-Cycle Update</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>24</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CPRD</name>
                  <description>PWM Channel Period Register</description>
                  <addressOffset>0x0C</addressOffset>
                  <size>32</size>
                  <fields>
                     <field>
                        <name>CPRD</name>
                        <description>Channel Period</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>24</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CPRDUPD</name>
                  <description>PWM Channel Period Update Register</description>
                  <addressOffset>0x10</addressOffset>
                  <size>32</size>
                  <access>write-only</access>
                  <fields>
                     <field>
                        <name>CPRDUPD</name>
                        <description>Channel Period Update</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>24</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CCNT</name>
                  <description>PWM Channel Counter Register</description>
                  <addressOffset>0x14</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <fields>
                     <field>
                        <name>CNT</name>
                        <description>Channel Counter Register</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>24</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DT</name>
                  <description>PWM Channel Dead Time Register</description>
                  <addressOffset>0x18</addressOffset>
                  <size>32</size>
                  <fields>
                     <field>
                        <name>DTH</name>
                        <description>Dead-Time Value for PWMHx Output</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                     <field>
                        <name>DTL</name>
                        <description>Dead-Time Value for PWMLx Output</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>DTUPD</name>
                  <description>PWM Channel Dead Time Update Register</description>
                  <addressOffset>0x1C</addressOffset>
                  <size>32</size>
                  <access>write-only</access>
                  <fields>
                     <field>
                        <name>DTHUPD</name>
                        <description>Dead-Time Value Update for PWMHx Output</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                     <field>
                        <name>DTLUPD</name>
                        <description>Dead-Time Value Update for PWMLx Output</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>16</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
            <register>
               <name>CMUPD0</name>
               <description>PWM Channel Mode Update Register (ch_num = 0)</description>
               <addressOffset>0x400</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>CPOLUP</name>
                     <description>Channel Polarity Update</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CPOLINVUP</name>
                     <description>Channel Polarity Inversion Update</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CMUPD1</name>
               <description>PWM Channel Mode Update Register (ch_num = 1)</description>
               <addressOffset>0x420</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>CPOLUP</name>
                     <description>Channel Polarity Update</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CPOLINVUP</name>
                     <description>Channel Polarity Inversion Update</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>ETRG1</name>
               <description>PWM External Trigger Register (trg_num = 1)</description>
               <addressOffset>0x42C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>MAXCNT</name>
                     <description>Maximum Counter value</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>24</bitWidth>
                  </field>
                  <field>
                     <name>TRGMODE</name>
                     <description>External Trigger Mode</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>TRGMODESelect</name>
                        <enumeratedValue>
                           <name>OFF</name>
                           <description>External trigger is not enabled.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MODE1</name>
                           <description>External PWM Reset Mode</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MODE2</name>
                           <description>External PWM Start Mode</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MODE3</name>
                           <description>Cycle-by-cycle Duty Mode</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TRGEDGE</name>
                     <description>Edge Selection</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>TRGEDGESelect</name>
                        <enumeratedValue>
                           <name>FALLING_ZERO</name>
                           <description>TRGMODE = 1: TRGINx event detection on falling edge.TRGMODE = 2, 3: TRGINx active level is 0</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RISING_ONE</name>
                           <description>TRGMODE = 1: TRGINx event detection on rising edge.TRGMODE = 2, 3: TRGINx active level is 1</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TRGFILT</name>
                     <description>Filtered input</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRGSRC</name>
                     <description>Trigger Source</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RFEN</name>
                     <description>Recoverable Fault Enable</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
